kAMDSuccess = "沒有錯誤。";
kAMDUndefinedError = "發生未知的錯誤。";
kAMDBadHeaderError = "無法傳送檔案。";
kAMDNoResourcesError = "無法配置資源。";
kAMDReadError = "無法讀取裝置。";
kAMDWriteError = "無法寫入裝置。";
kAMDUnknownPacketError = "未知的封包。";
kAMDInvalidArgumentError = "引數無效。";
kAMDNotFoundError = "找不到檔案。";
kAMDIsDirectoryError = "路徑為目錄。";
kAMDPermissionError = "您沒有權限。";
kAMDNotConnectedError = "尚未連接裝置。";
kAMDTimeOutError = "操作逾時。";
kAMDOverrunError = "緩衝區發生滿溢。";
kAMDEOFError = "檔案結尾。";
kAMDUnsupportedError = "不支援此操作。";
kAMDFileExistsError = "檔案已存在。";
kAMDBusyError = "裝置忙碌中。";
kAMDCryptoError = "無法建立與裝置的安全連線。";
kAMDTooBigError = "訊息太大。";
kAMDInvalidResponseError = "收到無法預期的裝置回應。";
kAMDMissingKeyError = "遺失密鑰。";
kAMDMissingValueError = "遺失數值。";
kAMDGetProhibitedError = "無法從鎖定密碼的裝置擷取數值。";
kAMDSetProhibitedError = "無法設定裝置上的數值。";
kAMDRemoveProhibitedError = "無法移除裝置上的數值。";
kAMDImmutableValueError = "無法更改此數值。";
kAMDPasswordProtectedError = "裝置受到密碼保護。";
kAMDMissingHostIDError = "裝置不辨識此主機。";
kAMDInvalidHostIDError = "裝置不辨識此主機。";
kAMDSessionActiveError = "已啟用區段。";
kAMDSessionInactiveError = "已停用區段。";
kAMDMissingSessionIDError = "遺失區段識別碼。";
kAMDInvalidSessionIDError = "區段識別碼無效。";
kAMDMissingServiceError = "遺失服務。";
kAMDInvalidServiceError = "服務無效。";
kAMDServiceLimitError = "已執行太多此服務的例項。";
kAMDCheckinSetupFailedError = "無法啟動裝置上的服務";
kAMDInvalidCheckinError = "無法啟動裝置上的服務";
kAMDCheckinTimeoutError = "尚未正確啟動裝置上的服務。";
kAMDCheckinConnectionFailedError = "尚未正確啟動裝置上的服務。";
kAMDCheckinReceiveFailedError = "尚未正確啟動裝置上的服務。";
kAMDCheckinResponseFailedError = "尚未正確啟動裝置上的服務。";
kAMDCheckinOutOfMemoryError = "尚未正確啟動裝置上的服務。";
kAMDCheckinSendFailedError = "尚未正確啟動裝置上的服務。";
kAMDMissingPairRecordError = "主機尚未與裝置配對。";
kAMDInvalidPairRecordError = "主機已不再與裝置配對。";
kAMDSavePairRecordFailedError = "無法儲存配對記錄。";
kAMDInvalidActivationRecordError = "啟用記錄無效。";
kAMDMissingActivationRecordError = "找不到啟用記錄。";
kAMDServiceProhibitedError = "無法啟動裝置上的服務。";
kAMDEscrowLockedError = "開機後第一次解鎖前將無法使用裝置。";
kAMDProhibitedBySupervision = "禁止在被監管的裝置上進行此操作。";
kAMDPairingProhibitedError = "僅允許透過 USB 配對。";
kAMDWrongDroidError = "裝置處於恢復模式。";
kAMDSUVerificationError = "無法驗證軟體更新套件。";
kAMDSUPatchError = "無法修補檔案。";
kAMDSUFirmwareError = "無法更新韌體。";
kAMDProvisioningProfileNotValid = "佈建描述檔無效。";
kAMDSendMessageError = "無法傳送訊息到裝置。";
kAMDReceiveMessageError = "無法接收裝置訊息。";
kAMDMissingOptionsError = "遺失選項。";
kAMDMissingImageTypeError = "遺失映像檔。";
kAMDDigestFailedError = "無法讀取磁碟映像檔。";
kAMDStartServiceError = "無法啟動服務。";
kAMDInvalidDiskImageError = "磁碟映像檔無效。";
kAMDMissingDigestError = "遺失摘要。";
kAMDMuxError = "USB 裝置多工器發生錯誤。";
kAMDApplicationAlreadyInstalledError = "帶有指定套件識別碼的系統應用程式已安裝於裝置上，無法加以取代。";
kAMDApplicationMoveFailedError = "無法將應用程式搬移到裝置上。";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "無法以 sandbox 技術限制應用程式。";
kAMDApplicationVerificationFailedError = "無法驗證應用程式。";
kAMDArchiveDestructionFailedError = "無法移除應用程式封存檔。";
kAMDBundleVerificationFailedError = "無法驗證電信業者套件。";
kAMDCarrierBundleCopyFailedError = "無法安裝電信業者套件。";
kAMDCarrierBundleDirectoryCreationFailedError = "無法建立電信業者套件目錄。";
kAMDCarrierBundleMissingSupportedSIMsError = "此電信業者套件沒有支援的 SIM。";
kAMDCommCenterNotificationFailedError = "無法接聽基頻通知。";
kAMDContainerCreationFailedError = "無法建立應用程式容器。";
kAMDContainerP0wnFailedError = "無法修復應用程式容器的權限。";
kAMDContainerRemovalFailedError = "無法移除應用程式容器。";
kAMDEmbeddedProfileInstallFailedError = "無法安裝內嵌的佈建描述檔。";
kAMDErrorError = "發生錯誤。";
kAMDExecutableTwiddleFailedError = "無法更改應用程式的執行權限。";
kAMDExistenceCheckFailedError = "無法查看是否已安裝應用程式。";
kAMDInstallMapUpdateFailedError = "無法更新安裝的應用程式列表。";
kAMDManifestCaptureFailedError = "無法儲存應用程式資訊檔。";
kAMDMapGenerationFailedError = "無法產生應用程式列表。";
kAMDMissingBundleExecutableError = "應用程式套件不包含執行檔。";
kAMDMissingBundleIdentifierError = "應用程式套件不包含有效的識別碼。";
kAMDMissingBundlePathError = "無法決定應用程式的套件路徑。";
kAMDMissingContainerError = "找不到安裝的應用程式容器。";
kAMDNotificationFailedError = "無法發表通知。";
kAMDPackageExtractionFailedError = "無法打開應用程式套件。";
kAMDPackageInspectionFailedError = "無法檢查應用程式套件。";
kAMDPackageMoveFailedError = "無法將應用程式套件搬移到臨時位置。";
kAMDPathConversionFailedError = "無法轉換路徑。";
kAMDRestoreContainerFailedError = "無法回復應用程式容器。";
kAMDSeatbeltProfileRemovalFailedError = "無法移除應用程式 seatbelt 描述檔。";
kAMDStageCreationFailedError = "無法建立臨時目錄。";
kAMDSymlinkFailedError = "無法建立符號連結。";
kAMDiTunesArtworkCaptureFailedError = "無法儲存 iTunes 插圖。";
kAMDiTunesMetadataCaptureFailedError = "無法儲存 iTunes 元資料。";
kAMDAlreadyArchivedError = "已封存應用程式。";
kAMDUnknownCommandError = "裝置不辨識指令。";
kAMDAPIInternalError = "發生內部 API 錯誤。";
kAMDMuxCreateListenerError = "無法監聽 USB 裝置。";
kAMDMuxGetListenerError = "無法取得 USB 監聽器。";
kAMDMuxConnectError = "無法連接裝置。";
kAMDDeviceTooNewError = "需要更新此應用程式。";
kAMDDeviceRefNoGood = "已不再連接此裝置。";
kAMDDeviceDisconnectedError = "已不再連接此裝置。";
kAMDCannotTranslateError = "無法轉譯裝置訊息";
kAMDMobileImageMounterMissingImageSignature = "不支援開發。";
kAMDMobileImageMounterResponseCreationFailed = "不支援開發。";
kAMDMobileImageMounterMissingImageType = "不支援開發。";
kAMDMobileImageMounterMissingImagePath = "不支援開發。";
kAMDMobileImageMounterImageMapLoadFailed = "不支援開發。";
kAMDMobileImageMounterAlreadyMounted = "不支援開發。";
kAMDMobileImageMounterImageMoveFailed = "不支援開發。";
kAMDMobileImageMounterMountPathMissing = "不支援開發。";
kAMDMobileImageMounterMountPathNotEmpty = "不支援開發。";
kAMDMobileImageMounterImageMountFailed = "不支援開發。";
kAMDMobileImageMounterTrustCacheLoadFailed = "不支援開發。";
kAMDMobileImageMounterDigestFailed = "不支援開發。";
kAMDMobileImageMounterDigestCreationFailed = "不支援開發。";
kAMDMobileImageMounterImageVerificationFailed = "不支援開發。";
kAMDMobileImageMounterImageInfoCreationFailed = "不支援開發。";
kAMDMobileImageMounterImageMapStoreFailed = "不支援開發。";
kAMDDeviceOSVersionTooLow = "裝置的 OS 版本太舊。";
kAMDNoWifiSyncSupportError = "裝置不支援無線同步。";
kAMDDeviceFamilyNotSupported = "此應用程式不支援此類型裝置。";
kAMDPackagePatchFailedError = "無法對應用程式套用批次更新";
kAMDIncorrectArchitectureError = "此應用程式不支援此裝置的 CPU 類型。";
kAMDPluginCopyFailedError = "無法拷貝“VPN 外掛模組”至應用程式容器。";
kAMDBreadcrumbFailedError = "無法寫入安裝路徑。";
kAMDBreadcrumbUnlockError = "無法更新安裝路徑。";
kAMDGeoJSONCaptureFailedError = "無法儲存 GeoJSON 資料。";
kAMDNewsstandArtworkCaptureFailedError = "無法儲存“書報攤”插圖。";
kAMDMissingCommandError = "此要求沒有包含指令。";
kAMDNotEntitledError = "要求的應用程式不允許此要求。";
kAMDMissingPackagePathError = "該要求遺失封包路徑。";
kAMDMissingContainerPathError = "該要求遺失容器路徑。";
kAMDMissingApplicationIdentifierError = "該要求遺失應用程式識別碼。";
kAMDMissingAttributeValueError = "該要求遺失必要的數值";
kAMDLookupFailedError = "無法列出安裝的應用程式。";
kAMDDictCreationFailedError = "無法從要求擷取功能。";

/* kMISFileError */
"A file operation failed." = "檔案作業失敗。";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "已新增、修改或刪除已簽署的資源。";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "找不到此執行檔的有效佈建描述檔。";

/* kMISUnknownError */
"An unknown error has occurred." = "發生未知的錯誤。";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "嘗試修改一個不可改變的佈建描述檔。";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "應用程式沒有有效的簽署。";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "應用程式的簽署有效，但其與預期雜湊的不符。";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "執行檔包含無效的簽署。";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "執行檔是由無效的授權所簽署。";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "用以簽署執行檔的識別身分已經失效。";

/* kMISSignatureNotValidError */
"The signature was not valid." = "簽署無效。";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "與裝置通訊時發生錯誤。";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "此佈建描述檔無法安裝在這部裝置上。";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "此佈建描述檔沒有有效的簽署（或者其簽署有效，但不是受信任的簽署）。";

/* kMISExpiredError */
"This provisioning profile has expired." = "此佈建描述檔已過期。";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "此佈建描述檔的形式不正確。";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "不支援此佈建描述檔。";

/* kMISAllocationError */
"Unable to allocate memory." = "無法配置記憶體。";

